[
  {
    "title": "Federal Reserve Signals Cautious Policy Stance Amid Economic Uncertainty",
    "summary": "An independent analysis based on recent public information regarding Federal Reserve policy signals. The summary highlights context, implications, and relevance for the United States.",
    "content": "",
    "category": "Policy",
    "date": "2026-01-20",
    "source": "https://feeds.federalreserve.gov/pressreleases.htm"
  },
  {
    "title": "US Job Growth Shows Signs of Moderation",
    "summary": "An independent analysis based on recent public information regarding labor market trends in the United States. The summary highlights context, implications, and relevance for the United States.",
    "content": "",
    "category": "Economy",
    "date": "2026-01-20",
    "source": "https://www.bls.gov/feed/bls_latest.rss"
  },
  {
    "title": "Consumer Spending Patterns Shift as Inflation Pressures Ease",
    "summary": "An independent analysis based on recent public information regarding consumer spending and inflation dynamics. The summary highlights context, implications, and relevance for the United States.",
    "content": "",
    "category": "Economy",
    "date": "2026-01-19",
    "source": "https://www.bea.gov/news/events/rss.xml"
  },
  {
    "title": "Technology Investment Accelerates Across US Enterprises",
    "summary": "An independent analysis based on recent public information regarding technology investment trends in the United States. The summary highlights context, implications, and relevance for the United States.",
    "content": "",
    "category": "Technology",
    "date": "2026-01-19",
    "source": "https://techcrunch.com/feed/"
  },
  {
    "title": "Policy Makers Weigh Regulatory Adjustments for Emerging Technologies",
    "summary": "An independent analysis based on recent public information regarding regulatory discussions around emerging technologies. The summary highlights context, implications, and relevance for the United States.",
    "content": "",
    "category": "Policy",
    "date": "2026-01-18",
    "source": "https://thehill.com/rss/syndicator/19110"
  },
  {
    "title": "US Equity Markets React to Shifting Interest Rate Expectations",
    "summary": "An independent analysis based on recent public information regarding market reactions to interest rate expectations. The summary highlights context, implications, and relevance for the United States.",
    "content": "",
    "category": "Markets",
    "date": "2026-01-18",
    "source": "https://feeds.reuters.com/reuters/businessNews"
  },
  {
    "title": "Artificial Intelligence Adoption Expands in Corporate Operations",
    "summary": "An independent analysis based on recent public information regarding artificial intelligence adoption in business operations. The summary highlights context, implications, and relevance for the United States.",
    "content": "",
    "category": "Technology",
    "date": "2026-01-17",
    "source": "https://www.wired.com/feed/rss"
  }
]
